yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3188.h
/* TIM3 status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char CC1OF       : 1;
  unsigned char CC2OF       : 1;
} __BITS_TIM3_SR2;
#endif
__IO_REG8_BIT(TIM3_SR2,    0x5287, __READ_WRITE, __BITS_TIM3_SR2);

/* TIM3 event generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char CC1G        : 1;
  unsigned char CC2G        : 1;
  unsigned char             : 3;
  unsigned char TG          : 1;
  unsigned char BG          : 1;
} __BITS_TIM3_EGR;
#endif
__IO_REG8_BIT(TIM3_EGR,    0x5288, __WRITE, __BITS_TIM3_EGR);

/* TIM3 Capture/Compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1S        : 2;
  unsigned char OC1FE       : 1;
  unsigned char OC1PE       : 1;
  unsigned char OC1M        : 3;
} __BITS_TIM3_CCMR1;
#endif
__IO_REG8_BIT(TIM3_CCMR1,  0x5289, __READ_WRITE, __BITS_TIM3_CCMR1);

/* TIM3 Capture/Compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC2S        : 2;
  unsigned char OC2FE       : 1;
  unsigned char OC2PE       : 1;
  unsigned char OC2M        : 3;
} __BITS_TIM3_CCMR2;
#endif
__IO_REG8_BIT(TIM3_CCMR2,  0x528A, __READ_WRITE, __BITS_TIM3_CCMR2);

/* TIM3 Capture/Compare enable register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1E        : 1;
  unsigned char CC1P        : 1;
  unsigned char             : 2;
  unsigned char CC2E        : 1;
  unsigned char CC2P        : 1;
} __BITS_TIM3_CCER1;
#endif
__IO_REG8_BIT(TIM3_CCER1,  0x528B, __READ_WRITE, __BITS_TIM3_CCER1);

/* TIM3 counter high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CNT8        : 1;
  unsigned char CNT9        : 1;
  unsigned char CNT10       : 1;
  unsigned char CNT11       : 1;
  unsigned char CNT12       : 1;
  unsigned char CNT13       : 1;
  unsigned char CNT14       : 1;
  unsigned char CNT15       : 1;
} __BITS_TIM3_CNTRH;
#endif
__IO_REG8_BIT(TIM3_CNTRH,  0x528C, __READ_WRITE, __BITS_TIM3_CNTRH);

/* TIM3 counter low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CNT0        : 1;
  unsigned char CNT1        : 1;
  unsigned char CNT2        : 1;
  unsigned char CNT3        : 1;
  unsigned char CNT4        : 1;
  unsigned char CNT5        : 1;
  unsigned char CNT6        : 1;
  unsigned char CNT7        : 1;
} __BITS_TIM3_CNTRL;
#endif
__IO_REG8_BIT(TIM3_CNTRL,  0x528D, __READ_WRITE, __BITS_TIM3_CNTRL);

/* TIM3 prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 3;
} __BITS_TIM3_PSCR;
#endif
__IO_REG8_BIT(TIM3_PSCR,   0x528E, __READ_WRITE, __BITS_TIM3_PSCR);

/* TIM3 Auto-reload register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ARR8        : 1;
  unsigned char ARR9        : 1;
  unsigned char ARR10       : 1;
  unsigned char ARR11       : 1;
  unsigned char ARR12       : 1;
  unsigned char ARR13       : 1;
  unsigned char ARR14       : 1;
  unsigned char ARR15       : 1;
} __BITS_TIM3_ARRH;
#endif
__IO_REG8_BIT(TIM3_ARRH,   0x528F, __READ_WRITE, __BITS_TIM3_ARRH);

/* TIM3 Auto-reload register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ARR0        : 1;
  unsigned char ARR1        : 1;
  unsigned char ARR2        : 1;
  unsigned char ARR3        : 1;
  unsigned char ARR4        : 1;
  unsigned char ARR5        : 1;
  unsigned char ARR6        : 1;
  unsigned char ARR7        : 1;
} __BITS_TIM3_ARRL;
#endif
__IO_REG8_BIT(TIM3_ARRL,   0x5290, __READ_WRITE, __BITS_TIM3_ARRL);

/* TIM3 Capture/Compare register 1 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR18       : 1;
  unsigned char CCR19       : 1;
  unsigned char CCR110      : 1;
  unsigned char CCR111      : 1;
  unsigned char CCR112      : 1;
  unsigned char CCR113      : 1;
  unsigned char CCR114      : 1;
  unsigned char CCR115      : 1;
} __BITS_TIM3_CCR1H;
#endif
__IO_REG8_BIT(TIM3_CCR1H,  0x5291, __READ_WRITE, __BITS_TIM3_CCR1H);

/* TIM3 Capture/Compare register 1 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR10       : 1;
  unsigned char CCR11       : 1;
  unsigned char CCR12       : 1;
  unsigned char CCR13       : 1;
  unsigned char CCR14       : 1;
  unsigned char CCR15       : 1;
  unsigned char CCR16       : 1;
  unsigned char CCR17       : 1;
} __BITS_TIM3_CCR1L;
#endif
__IO_REG8_BIT(TIM3_CCR1L,  0x5292, __READ_WRITE, __BITS_TIM3_CCR1L);

/* TIM3 Capture/Compare register 2 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR28       : 1;
  unsigned char CCR29       : 1;
  unsigned char CCR210      : 1;
  unsigned char CCR211      : 1;
  unsigned char CCR212      : 1;
  unsigned char CCR213      : 1;
  unsigned char CCR214      : 1;
  unsigned char CCR215      : 1;
} __BITS_TIM3_CCR2H;
#endif
__IO_REG8_BIT(TIM3_CCR2H,  0x5293, __READ_WRITE, __BITS_TIM3_CCR2H);

/* TIM3 Capture/Compare register 2 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR10       : 1;
  unsigned char CCR11       : 1;
  unsigned char CCR12       : 1;
  unsigned char CCR13       : 1;
  unsigned char CCR14       : 1;
  unsigned char CCR15       : 1;
  unsigned char CCR16       : 1;
  unsigned char CCR17       : 1;
} __BITS_TIM3_CCR2L;
#endif
__IO_REG8_BIT(TIM3_CCR2L,  0x5294, __READ_WRITE, __BITS_TIM3_CCR2L);

/* TIM3 break register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LOCK        : 2;
  unsigned char OSSI        : 1;
  unsigned char             : 1;
  unsigned char BKE         : 1;
  unsigned char BKP         : 1;
  unsigned char AOE         : 1;
  unsigned char MOE         : 1;
} __BITS_TIM3_BKR;
#endif
__IO_REG8_BIT(TIM3_BKR,    0x5295, __READ_WRITE, __BITS_TIM3_BKR);

/* TIM3 output idle state register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char OIS1        : 1;
  unsigned char             : 1;
  unsigned char OIS2        : 1;
} __BITS_TIM3_OISR;
#endif
__IO_REG8_BIT(TIM3_OISR,   0x5296, __READ_WRITE, __BITS_TIM3_OISR);


/*-------------------------------------------------------------------------
 *      TIM3 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

