yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3188.h
#define MASK_ITC_SPR8_VECT28SPR  0x03
#define MASK_ITC_SPR8_VECT29SPR  0x0C


/*-------------------------------------------------------------------------
 *      SWIM register definitions
 *-----------------------------------------------------------------------*/
/* SWIM control status register */
__IO_REG8    (SWIM_CSR,    0x7F80, __READ_WRITE);


/*-------------------------------------------------------------------------
 *      DM register definitions
 *-----------------------------------------------------------------------*/
/* DM breakpoint 1 register extended byte */
__IO_REG8    (DM_BK1RE,    0x7F90, __READ_WRITE);
/* DM breakpoint 1 register high byte */
__IO_REG8    (DM_BK1RH,    0x7F91, __READ_WRITE);
/* DM breakpoint 1 register low byte */
__IO_REG8    (DM_BK1RL,    0x7F92, __READ_WRITE);
/* DM breakpoint 2 register extended byte */
__IO_REG8    (DM_BK2RE,    0x7F93, __READ_WRITE);
/* DM breakpoint 2 register high byte */
__IO_REG8    (DM_BK2RH,    0x7F94, __READ_WRITE);
/* DM breakpoint 2 register low byte */
__IO_REG8    (DM_BK2RL,    0x7F95, __READ_WRITE);
/* DM Debug module control register 1 */
__IO_REG8    (DM_CR1,      0x7F96, __READ_WRITE);
/* DM Debug module control register 2 */
__IO_REG8    (DM_CR2,      0x7F97, __READ_WRITE);
/* DM Debug module control/status register 1 */
__IO_REG8    (DM_CSR1,     0x7F98, __READ_WRITE);
/* DM Debug module control/status register 2 */
__IO_REG8    (DM_CSR2,     0x7F99, __READ_WRITE);
/* DM enable function register */
__IO_REG8    (DM_ENFCTR,   0x7F9A, __READ_WRITE);


/*-------------------------------------------------------------------------
 *      Interrupt vector numbers
 *
 *  Note: The vector numbers listed in ST's manuals for STM8 are offset
 *        by 2 compared to the vector numbers used by EWSTM8.
 *-----------------------------------------------------------------------*/
#define FLASH_EOP_vector                      3 /* IRQ No. in STM8 manual:  1 */
#define FLASH_WR_PG_DIS_vector                3 /* IRQ No. in STM8 manual:  1 */
#define DMA1_CH0_HT_vector                    4 /* IRQ No. in STM8 manual:  2 */
#define DMA1_CH0_TC_vector                    4 /* IRQ No. in STM8 manual:  2 */
#define DMA1_CH1_HT_vector                    4 /* IRQ No. in STM8 manual:  2 */
#define DMA1_CH1_TC_vector                    4 /* IRQ No. in STM8 manual:  2 */
#define DMA1_CH2_HT_vector                    5 /* IRQ No. in STM8 manual:  3 */
#define DMA1_CH2_TC_vector                    5 /* IRQ No. in STM8 manual:  3 */
#define DMA1_CH3_HT_vector                    5 /* IRQ No. in STM8 manual:  3 */
#define DMA1_CH3_TC_vector                    5 /* IRQ No. in STM8 manual:  3 */
#define LSE_CSS_vector                        6 /* IRQ No. in STM8 manual:  4 */
#define RTC_ALARM_vector                      6 /* IRQ No. in STM8 manual:  4 */
#define RTC_TAMP1_vector                      6 /* IRQ No. in STM8 manual:  4 */
#define RTC_TAMP2_vector                      6 /* IRQ No. in STM8 manual:  4 */
#define RTC_TAMP3_vector                      6 /* IRQ No. in STM8 manual:  4 */
#define RTC_WAKEUP_vector                     6 /* IRQ No. in STM8 manual:  4 */
#define EXTIE_vector                          7 /* IRQ No. in STM8 manual:  5 */
#define EXTIF_vector                          7 /* IRQ No. in STM8 manual:  5 */
#define EXTIPVD_vector                        7 /* IRQ No. in STM8 manual:  5 */
#define EXTIB_vector                          8 /* IRQ No. in STM8 manual:  6 */
#define EXTIG_vector                          8 /* IRQ No. in STM8 manual:  6 */
#define EXTID_vector                          9 /* IRQ No. in STM8 manual:  7 */
#define EXTIH_vector                          9 /* IRQ No. in STM8 manual:  7 */
#define EXTI0_vector                         10 /* IRQ No. in STM8 manual:  8 */
#define EXTI1_vector                         11 /* IRQ No. in STM8 manual:  9 */
#define EXTI2_vector                         12 /* IRQ No. in STM8 manual: 10 */
#define EXTI3_vector                         13 /* IRQ No. in STM8 manual: 11 */
#define EXTI4_vector                         14 /* IRQ No. in STM8 manual: 12 */
#define EXTI5_vector                         15 /* IRQ No. in STM8 manual: 13 */
#define EXTI6_vector                         16 /* IRQ No. in STM8 manual: 14 */
#define EXTI7_vector                         17 /* IRQ No. in STM8 manual: 15 */
#define CLK_CSS_vector                       19 /* IRQ No. in STM8 manual: 17 */
#define CLK_SWITCH_vector                    19 /* IRQ No. in STM8 manual: 17 */
#define DAC_DMAUDR1_vector                   19 /* IRQ No. in STM8 manual: 17 */
#define DAC_DMAUDR2_vector                   19 /* IRQ No. in STM8 manual: 17 */
#define TIM1_BIF_vector                      19 /* IRQ No. in STM8 manual: 17 */
#define ADC1_AWD_vector                      20 /* IRQ No. in STM8 manual: 18 */
#define ADC1_EOC_vector                      20 /* IRQ No. in STM8 manual: 18 */
#define ADC1_OVER_vector                     20 /* IRQ No. in STM8 manual: 18 */
#define COMP_EF1_vector                      20 /* IRQ No. in STM8 manual: 18 */
#define COMP_EF2_vector                      20 /* IRQ No. in STM8 manual: 18 */
#define TIM2_BIF_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define TIM2_OVR_UIF_vector                  21 /* IRQ No. in STM8 manual: 19 */
#define TIM2_TIF_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define USART2_T_TC_vector                   21 /* IRQ No. in STM8 manual: 19 */
#define USART2_T_TXE_vector                  21 /* IRQ No. in STM8 manual: 19 */
#define TIM2_CAPCOM_CC1IF_vector             22 /* IRQ No. in STM8 manual: 20 */
#define TIM2_CAPCOM_CC2IF_vector             22 /* IRQ No. in STM8 manual: 20 */
#define USART2_R_IDLE_vector                 22 /* IRQ No. in STM8 manual: 20 */
#define USART2_R_OR_vector                   22 /* IRQ No. in STM8 manual: 20 */
#define USART2_R_PE_vector                   22 /* IRQ No. in STM8 manual: 20 */
#define USART2_R_RXNE_vector                 22 /* IRQ No. in STM8 manual: 20 */
#define TIM3_BIF_vector                      23 /* IRQ No. in STM8 manual: 21 */
#define TIM3_OVR_UIF_vector                  23 /* IRQ No. in STM8 manual: 21 */
#define TIM3_TIF_vector                      23 /* IRQ No. in STM8 manual: 21 */
#define USART3_T_TC_vector                   23 /* IRQ No. in STM8 manual: 21 */
#define USART3_T_TXE_vector                  23 /* IRQ No. in STM8 manual: 21 */
#define TIM3_CAPCOM_CC1IF_vector             24 /* IRQ No. in STM8 manual: 22 */
#define TIM3_CAPCOM_CC2IF_vector             24 /* IRQ No. in STM8 manual: 22 */
#define USART3_R_IDLE_vector                 24 /* IRQ No. in STM8 manual: 22 */
#define USART3_R_OR_vector                   24 /* IRQ No. in STM8 manual: 22 */
#define USART3_R_PE_vector                   24 /* IRQ No. in STM8 manual: 22 */
#define USART3_R_RXNE_vector                 24 /* IRQ No. in STM8 manual: 22 */
#define TIM1_OVR_UIF_vector                  25 /* IRQ No. in STM8 manual: 23 */
#define TIM1_CAPCOM_CC1IF_vector             26 /* IRQ No. in STM8 manual: 24 */
#define TIM1_CAPCOM_CC2IF_vector             26 /* IRQ No. in STM8 manual: 24 */
#define TIM1_CAPCOM_CC3IF_vector             26 /* IRQ No. in STM8 manual: 24 */
#define TIM1_CAPCOM_CC4IF_vector             26 /* IRQ No. in STM8 manual: 24 */
#define TIM1_CAPCOM_COMIF_vector             26 /* IRQ No. in STM8 manual: 24 */
#define TIM1_CAPCOM_TIF_vector               26 /* IRQ No. in STM8 manual: 24 */
#define TIM4_TIF_vector                      27 /* IRQ No. in STM8 manual: 25 */
#define TIM4_UIF_vector                      27 /* IRQ No. in STM8 manual: 25 */
#define SPI1_MODF_vector                     28 /* IRQ No. in STM8 manual: 26 */
#define SPI1_OVR_vector                      28 /* IRQ No. in STM8 manual: 26 */
#define SPI1_RXNE_vector                     28 /* IRQ No. in STM8 manual: 26 */
#define SPI1_TXE_vector                      28 /* IRQ No. in STM8 manual: 26 */
#define SPI1_WKUP_vector                     28 /* IRQ No. in STM8 manual: 26 */
#define TIM5_BIF_vector                      29 /* IRQ No. in STM8 manual: 27 */
#define TIM5_OVR_UIF_vector                  29 /* IRQ No. in STM8 manual: 27 */
#define TIM5_TIF_vector                      29 /* IRQ No. in STM8 manual: 27 */
#define USART1_T_TC_vector                   29 /* IRQ No. in STM8 manual: 27 */
#define USART1_T_TXE_vector                  29 /* IRQ No. in STM8 manual: 27 */
#define TIM5_CAPCOM_CC1IF_vector             30 /* IRQ No. in STM8 manual: 28 */
#define TIM5_CAPCOM_CC2IF_vector             30 /* IRQ No. in STM8 manual: 28 */
#define USART1_R_IDLE_vector                 30 /* IRQ No. in STM8 manual: 28 */
#define USART1_R_OR_vector                   30 /* IRQ No. in STM8 manual: 28 */
#define USART1_R_PE_vector                   30 /* IRQ No. in STM8 manual: 28 */
#define USART1_R_RXNE_vector                 30 /* IRQ No. in STM8 manual: 28 */
#define I2C1_ADD10_vector                    31 /* IRQ No. in STM8 manual: 29 */
#define I2C1_ADDR_vector                     31 /* IRQ No. in STM8 manual: 29 */
#define I2C1_AF_vector                       31 /* IRQ No. in STM8 manual: 29 */
#define I2C1_ARLO_vector                     31 /* IRQ No. in STM8 manual: 29 */
#define I2C1_BERR_vector                     31 /* IRQ No. in STM8 manual: 29 */
#define I2C1_BTF_vector                      31 /* IRQ No. in STM8 manual: 29 */
#define I2C1_OVR_vector                      31 /* IRQ No. in STM8 manual: 29 */
#define I2C1_RXNE_vector                     31 /* IRQ No. in STM8 manual: 29 */
#define I2C1_SB_vector                       31 /* IRQ No. in STM8 manual: 29 */
#define I2C1_STOPF_vector                    31 /* IRQ No. in STM8 manual: 29 */
#define I2C1_TXE_vector                      31 /* IRQ No. in STM8 manual: 29 */
#define I2C1_WUFH_vector                     31 /* IRQ No. in STM8 manual: 29 */
#define SPI2_MODF_vector                     31 /* IRQ No. in STM8 manual: 29 */
#define SPI2_OVR_vector                      31 /* IRQ No. in STM8 manual: 29 */
#define SPI2_RXNE_vector                     31 /* IRQ No. in STM8 manual: 29 */
#define SPI2_TXE_vector                      31 /* IRQ No. in STM8 manual: 29 */
#define SPI2_WKUP_vector                     31 /* IRQ No. in STM8 manual: 29 */

#ifdef __IAR_SYSTEMS_ICC__
#pragma language=restore
#endif

#endif    /* __IOSTM8AL3188_H__ */

/*----------------------------------------------
 *      End of file
 *--------------------------------------------*/
